#include<iostream>
#include<Windows.h>

int main()
{
	using namespace std;
	SetConsoleOutputCP(65001);
	SetConsoleCP(65001);

	cout << "привіт! гарний і чудовий ранок :)\n";

	//int i = 0;
	//i = i + 1;
	//i++;
	//i = i - 1;
	//i--;

	//Для роботи з циклом for є спеціальний синтексис його запису
  //int i = 0;
  //i = i + 1; //так писати не зручно
  //i++; // аналогічно, як i = i + 1; - оператор інкременту
  //i = i - 1; // зменшення на 1
  //i--; // аналогічно, що i = i - 1;
  // Що робить цикл - повтор декілька разів 1 туж саму операцію
  // кількість постворів, може визначати, якась змінна n
  //for(ініціалізація_змінних_циклу;умова_продовження_циклу;лічильник_циклу)
  // { -- початок роботи циклу - тіла його
  // ...  тіло циклу - блок коду в циклі
  // } -- кінець тіла циклу
  //ініціалізація_змінних_циклу - виконується 1 раз під час початку циклу
  //умова_продовження_циклу - перевіряється на кожній ітерації циклу
  //лічильник_циклу - змінуює крок роботи циклу - виконується кожен раз після тіла циклу
  //Зробимо циклу, який виводиться числа від 1 до 10

	int  n = 10;
	for (int i = 1; i<=10; i++)
	{
		cout << i << '\n';
		cout << i << '\t';
	}
	cout << "\n";
	int begin, end;
	cout << "Введіть початок діапазону: ";
	cin >> begin;
	cout << "Введіть кінець діапазону: ";
	cin >> end;
	for (int i = begin; i <= end; i++)
	{
		if (i % 2 == 0)
			cout << i << '\n';
	}
	cout << "\nThank you :)";
	return 0;

}
